#include<bits/stdc++.h>
using namespace std;
int main(){
	int pc_1[8][7]={
		 {57, 49, 41, 33, 25, 17, 9},   // 第1行（表头）
        {1, 58, 50, 42, 34, 26, 18},    // 第2行
        {10, 2, 59, 51, 43, 35, 27},     // 第3行
        {19, 11, 3, 60, 52, 44, 36},     // 第4行
        {63, 55, 47, 39, 31, 23, 15},    // 第5行
        {7, 62, 54, 46, 38, 30, 22},     // 第6行
        {14, 6, 61, 53, 45, 37, 29},     // 第7行（原代码漏了这一行！）
        {21, 13, 5, 28, 20, 12, 4}       // 第8行
	};
	int pc_2[8][6]={
		{14, 17, 11, 24,  1,  5},  // 第1行
        { 3, 28, 15,  6, 21, 10},  // 第2行
        {23, 19, 12,  4, 26,  8},  // 第3行
        {16,  7, 27, 20, 13,  2},  // 第4行
        {41, 52, 31, 37, 47, 55},  // 第5行
        {30, 40, 51, 45, 33, 48},  // 第6行
        {44, 49, 39, 56, 34, 53},  // 第7行
        {46, 42, 50, 36, 29, 32}   // 第8行
	};
	int key_64[8][8]={0};
	int key_56[8][7]={0};
	cout<<"输入64位密钥："<<endl;
	for(int i=0;i<8;i++){
		for(int j=0;j<8;j++){
			cin>>key_64[i][j];
		}
	}
	//置换选择1 
	for(int i=0;i<8;i++){
		for(int j=0;j<7;j++){
			key_56[i][j]=key_64[(pc_1[i][j]-1)/8][(pc_1[i][j]-1)%8];
		}
	}
	//循环左移第一轮 
	 int c0[28],d0[28];
	 for(int i=0;i<8;i++){
	 	for(int j=0;j<7;j++){
	 		if(i<=3){
	 			c0[i*7+j]=key_56[i][j];
			 }
			 else d0[(i-4)*7+j]=key_56[i][j];
		 }	 
	 } 
	 int c1[28],d1[28];
	 c1[27]=c0[0];
	 d1[27]=d0[0];
	 for(int i=0;i<27;i++){
	 	c1[i]=c0[i+1];
	 	d1[i]=d0[i+1];
	 }
	 int middle_56[8][7]={0};
	 int key_48[8][6]={0};
	 for(int i=0;i<8;i++){
	 	for(int j=0;j<7;j++){
	 		if(i<=3){
	 			middle_56[i][j]=c1[i*7+j];
			 }
			 else middle_56[i][j]=d1[(i-4)*7+j];
		 }
	 }
	 //置换选择2
	  for(int i=0;i<8;i++){
	  	for(int j=0;j<6;j++){
	  		key_48[i][j]=middle_56[(pc_2[i][j]-1)/7][(pc_2[i][j]-1)%7];
		  }
	  } 
	  cout<<"第一轮子密钥为："<<endl;
	  for(int i=0;i<8;i++){
	  	for(int j=0;j<6;j++){
	  		cout<<key_48[i][j]<<' ';
		  }
		  cout<<endl;
	  }
	  //第二轮循环左移 
	  int c2[28],d2[28];
	  c2[27]=c1[0];
	  d2[27]=d1[0];
	  for(int i=0;i<27;i++){
	 	c2[i]=c1[i+1];
	 	d2[i]=d1[i+1];
	 } 
	 int middle_56_2[8][7]={0};
	 int key_48_2[8][6]={0};
	 for(int i=0;i<8;i++){
	 	for(int j=0;j<7;j++){
	 		if(i<=3){
	 			middle_56_2[i][j]=c2[i*7+j];
			 }
			 else middle_56_2[i][j]=d2[(i-4)*7+j];
		 }
	 }
	 //置换选择2
	  for(int i=0;i<8;i++){
	  	for(int j=0;j<6;j++){
	  		key_48_2[i][j]=middle_56_2[(pc_2[i][j]-1)/7][(pc_2[i][j]-1)%7];
		  }
	  } 
	  cout<<"第二轮子密钥为："<<endl;
	  for(int i=0;i<8;i++){
	  	for(int j=0;j<6;j++){
	  		cout<<key_48_2[i][j]<<' ';
		  }
		  cout<<endl;
	  }
	return 0;
} 
